**Задача алгоритмически не самая сложная, однако для полноценного выполнения проверочной работы необходимо:**

*1. Создать репозиторий на GitHub
2. Нарисовать блок-схему алгоритма (можно обойтись блок-схемой основной содержательной части, если вы выделяете её в отдельный метод)
3. Снабдить репозиторий оформленным текстовым описанием решения (файл README.md)
4. Написать программу, решающую поставленную задачу
5. Использовать контроль версий в работе над этим небольшим проектом (не должно быть так, что всё залито одним коммитом, как минимум этапы 2, 3, и 4 должны быть расположены в разных коммитах)*

***Задача: Написать программу, которая из имеющегося массива строк формирует новый массив из строк, длина которых меньше, либо равна 3 символам. Первоначальный массив можно ввести с клавиатуры, либо задать на старте выполнения алгоритма. При решении не рекомендуется пользоваться коллекциями, лучше обойтись исключительно массивами.***

<font size="6">
Программа написана языке C# </font>

# Описание решения задачи

## Задача

Написать программу, которая запрашивает у пользователя элементы массива, разделенные запятой, и выводит новый массив, содержащий только те элементы, которые имеют длину не более трех символов.

## Решение

1. Запросить у пользователя элементы массива, разделенные запятой.
2. Разбить строку на элементы массива с помощью метода Split().
3. Создать переменную count для подсчета количества элементов массива, которые имеют длину не более трех символов.
4. Пройти циклом по всем элементам массива и для каждого элемента проверить его длину с помощью свойства Length. Если длина элемента не превышает трех символов, то увеличить переменную count.
5. Создать новый массив newArray длиной count.
6. Пройти циклом по всем элементам массива и для каждого элемента проверить его длину с помощью свойства Length. Если длина элемента не превышает трех символов, то добавить его в новый массив newArray.
7. Вывести новый массив newArray на экран.

## Используемые методы и свойства

- Console.ReadLine() - метод для чтения вводимых данных с консоли.
- string.Split() - метод для разбиения строки на массив строк по указанному разделителю.
- string.Length - свойство для получения длины строки.
- foreach - оператор для перебора элементов массива.
- Console.WriteLine() - метод для вывода данных на консоль.

## Пример работы программы


Введите элементы массива через запятую:
apple, cat, dog, car, bee, ant, bat
Новый массив:
cat
dog
bee
ant
bat